ELPasEDT/src/Documents/РасходРеагента/РасходРеагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходРеагента</name>
  <basedOn>Document.ПриходРеагента</basedOn>
  <registerRecords>AccumulationRegister.ИспользованиеРеагентов</registerRecords>
  <registerRecords>AccumulationRegister.РеагентыВПодразделениях</registerRecords>
  <attributes>
    <name>ВидРасхода</name>
    <type>
      <types>CatalogRef.ВидыРасходаРеагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходРеагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписатьВЖурналУчетаРеагентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПриемаСмены</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Вахта</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеРасхода</name>
    <type>
      <types>CatalogRef.НаправленияРасходаРеагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасхода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьОтменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВключатьВЖурнал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Расход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВБазовойЕдинице</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ELPasEDT/src/InformationRegisters/ОборудованиеХимЦеха/ОборудованиеХимЦеха.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОборудованиеХимЦеха</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КонтрольМаксЗначениеКонцентрации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрольМаксЗначениеУровня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрольМинЗначениеКонцентрации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрольМинЗначениеУровня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ОстановкаОборудованияНаГраницеСменыИлиПериода</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлощадьОснования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>РасходИЗакачкаОдновременно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеОборудования</name>
    <type>
      <types>EnumRef.СостоянияОборудования</types>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьСостояниеВИнформационнойПанелиАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СообщающиесяСосуды</name>
    <type>
      <types>CatalogRef.СообщающиесяСосуды</types>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/Catalogs/ВидыРасходаРеагентов/ВидыРасходаРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРасходаРеагентов</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НаправленияРасхода</name>
    <attributes>
      <name>ВидРеагента</name>
      <type>
        <types>EnumRef.ВидыРеагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеРасхода</name>
      <type>
        <types>CatalogRef.НаправленияРасходаРеагентов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ELPasEDT/src/Documents/РасходРеагента/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПартияПриИзмененииНаСервере()
	
	Объект.ВидРеагента   = Объект.Партия.ВидРеагента;
	Объект.Подразделение = Объект.Партия.Подразделение;
	Объект.Реагент       = Объект.Партия.Реагент;
	
КонецПроцедуры

&НаКлиенте
Процедура ПартияПриИзменении(Элемент)
	ПартияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Не РольДоступна("ПолныеПрава") И Не РольДоступна("ИнженерХВО") И Параметры.Свойство("ДокументПриемаСмены") 
			И Параметры.ДокументПриемаСмены <> Объект.ДокументПриемаСмены Тогда
			
			ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("КлючЗаписи") Тогда
		СтрокаЖурнала = Параметры.КлючЗаписи;
	КонецЕсли;
	
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.Ответственный.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	ЗаполнитьСписокНаправленийРасхода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если СтрокаЖурнала <> Неопределено Тогда
		//Оповестить("ИзменениеСтроки", СтрокаЖурнала);
		Оповестить("ИзмененаЗаписьЖургала", Новый Структура("Подразделение, Ссылка", Объект.Подразделение, Объект.Ссылка));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокНаправленийРасхода(Очистить = Ложь)
	
	Если Очистить И СтрокаЖурнала <> Неопределено Тогда
		СтрокаЖурнала.НаправлениеРасхода = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВидыРасходаРеагентовНаправленияРасхода.НаправлениеРасхода КАК НаправлениеРасхода,
	|	ПРЕДСТАВЛЕНИЕ(ВидыРасходаРеагентовНаправленияРасхода.НаправлениеРасхода) КАК НаправлениеРасходаПредставление,
	|	ВидыРасходаРеагентовНаправленияРасхода.НаправлениеРасхода.ДиспетчерскоеНаименование КАК НаправлениеРасходаДиспетчерскоеНаименование
	|ИЗ
	|	Справочник.ВидыРасходаРеагентов.НаправленияРасхода КАК ВидыРасходаРеагентовНаправленияРасхода
	|ГДЕ
	|	ВидыРасходаРеагентовНаправленияРасхода.Ссылка = &Ссылка
	|	И ВидыРасходаРеагентовНаправленияРасхода.ВидРеагента = &ВидРеагента");
	Запрос.УстановитьПараметр("Ссылка", Объект.ВидРасхода);
	Запрос.УстановитьПараметр("ВидРеагента", Объект.ВидРеагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Элементы.НаправлениеРасхода.СписокВыбора.Очистить();
	Пока Выборка.Следующий() Цикл
		Представление = Выборка.НаправлениеРасходаПредставление;
		Если Не ПустаяСтрока(Выборка.НаправлениеРасходаДиспетчерскоеНаименование) Тогда
			Представление = Представление + " (" + Выборка.НаправлениеРасходаДиспетчерскоеНаименование + ")"
		КонецЕсли;
		Элементы.НаправлениеРасхода.СписокВыбора.Добавить(Выборка.НаправлениеРасхода, Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидРасходаПриИзменении(Элемент)
	ЗаполнитьСписокНаправленийРасхода();
	Объект.НаправлениеРасхода = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Объект.Организация = ПолучитьЗначениеРеквизита(Объект.Подразделение, "Организация");
	Иначе
		Объект.Организация = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизита(Ссылув, ИмяРеквизита)
	Возврат Ссылув[ИмяРеквизита];
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
КонецПроцедуры

&НаКлиенте
Процедура РеагентПриИзменении(Элемент)
	Объект.ВидРеагента = ПолучитьЗначениеРеквизита(Объект.Реагент, "ВидРеагента");
	ЗаполнитьСписокНаправленийРасхода(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВидРеагентаПриИзменении(Элемент)
	ЗаполнитьСписокНаправленийРасхода(Истина);
КонецПроцедуры

&НаСервере
Процедура ОборудованиеПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Оборудование) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОборудованиеХимЦехаСрезПоследних.ВидРеагента КАК ВидРеагента,
	|	ОборудованиеХимЦехаСрезПоследних.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрСведений.ОборудованиеХимЦеха.СрезПоследних(&Период, Оборудование = &Оборудование) КАК ОборудованиеХимЦехаСрезПоследних");
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Оборудование", Объект.Оборудование);
	
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.ВидРеагента   = Выборка.ВидРеагента;
		Объект.Подразделение = Выборка.Подразделение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Объект.Организация = ПолучитьЗначениеРеквизита(Объект.Подразделение, "Организация");
	Иначе
		Объект.Организация = Неопределено;
	КонецЕсли;
	
	ЗаполнитьСписокНаправленийРасхода(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеПриИзменении(Элемент)
	ОборудованиеПриИзмененииНаСервере();
КонецПроцедуры
